[
    {
      "title": "THE BEST CHOCOLATE CHIP COOKIE RECIPE EVER",
      "subTitle": "https://joyfoodsunshine.com/the-most-amazing-chocolate-chip-cookies/",
      "instructions": "Ingredients\n1 cup salted butter* softened\n1 cup white (granulated) sugar\n1 cup light brown sugar packed\n2 tsp pure vanilla extract\n2 large eggs\n3 cups all-purpose flour\n1 tsp baking soda\n½ tsp baking powder\n1 tsp sea salt***\n2 cups chocolate chips (or chunks, or chopped chocolate)\nInstructions\nPreheat oven to 375 degrees F. Line a baking pan with parchment paper and set aside.\nIn a separate bowl mix flour, baking soda, salt, baking powder. Set aside.\nCream together butter and sugars until combined.\nBeat in eggs and vanilla until fluffy.\nMix in the dry ingredients until combined.\nAdd 12 oz package of chocolate chips and mix well.\nRoll 2-3 TBS (depending on how large you like your cookies) of dough at a time into balls and place them evenly spaced on your prepared cookie sheets. (alternately, use a small cookie scoop to make your cookies).\nBake in preheated oven for approximately 8-10 minutes. Take them out when they are just BARELY starting to turn brown.\nLet them sit on the baking pan for 2 minutes before removing to cooling rack.\nNotes\nRecipe information calculated based on this recipe making 36 cookies - 2 TBS of dough a piece)\nDo not over bake\nWhen you remove the cookies from the oven they will still look doughy. THIS is the secret that makes these cookies so absolutely amazing! Please, I beg you, do NOT over bake!\nIngredient Substitutions\nButter. I use salted butter, but unsalted butter would also be great. I just recommend tasting the dough to ensure that it's salted to your liking.\nWhite Sugar.  You can use granulated white sugar or organic cane sugar.\nBrown sugar. I use light brown sugar in this recipe for the best results.\nFlour. I recommend using an unbleached, all-purpose flour to make these chocolate chip cookies. Many readers have used gluten-free all-purpose flour with excellent results. \nSea Salt. I exclusively bake and cook with pure, fine sea salt. Sea salt is different than table salt (that is iodized), so if you use salt other than sea salt I recommend testing the recipe first with ½ tsp and then adjusting to your taste.\nChocolate Chips. As you can see from the photos, sometimes I use chocolate chunks, chopped chocolate, or chocolate chips. It doesn't matter what you use, as long as you use 2 cups.\nHow to freeze chocolate chip cookie dough\nPortion dough, roll into balls and freeze in a single layer in an airtight container for up to 2 months. \nNote on the amount of flour in grams - the traditional conversion from cups to grams is 120 g all-purpose flour in 1 cup, which would mean this recipe needs 360 g flour. When I weigh the flour I use to make the perfect cookies it comes out to be 430 to 450 g depending on the size of my eggs. I suggest starting with 360 and increasing as necessary. The dough should not be wet or sticky but it also should not be dry or crumbly.\nStore\nStore these chocolate chip cookies in an airtight container at room temperature for up to 5 days, or in the freezer for up to 2 months. \n \nNutrition\nServing: 1cookie (using 3 TBS dough) | Calories: 183kcal | Carbohydrates: 26g | Protein: 2g | Fat: 8g | Saturated Fat: 5g | Cholesterol: 27mg | Sodium: 153mg | Potassium: 31mg | Fiber: 1g | Sugar: 18g | Vitamin A: 197IU | Vitamin C: 1mg | Calcium: 24mg | Iron: 1mg",
      "picture": "https://joyfoodsunshine.com/wp-content/uploads/2018/02/best-chocolate-chip-cookies-recipe-1.jpg"
    },
    {
        "title": "Breakfast Casserole",
        "subTitle": null,
        "tags": ["Madsen", "breakfast", "AH"],
        "ingredients": ["1 pound bacon (diced) or sausage", "1 medium onion, diced", "6 eggs", "4 c. frozen shredded hash browns",
        "2 c. grated cheese", "1 ½ c. cottage cheese"],
        "instructions": "Cook meat and onions, drain.  Mix with remaining ingredients and pour into a greased 9X13 inch pan.  Bake at 350 degrees for 35-40 minutes.  Let stand 10 minutes before cutting and serving.",
        "picture": null
    },
    {
        "title": "Buttermilk Syrup",
        "subTitle": null,
        "tags": ["Madsen", "AH", "breakfast", "Misc"],
        "ingredients": ["1 c. buttermilk", "1 c. sugar", "1 cube of butter", "1 t. vanilla", "1/2 t. baking soda"],
        "instructions": "Melt butter and add buttermilk and sugar.  Bring to a boil.  Add vanilla and baking soda and remove from heat.  Serve over French toast and berries.",
        "picture": null
    },
    {
        "title": "Cottage Cheese Pancakes",
        "subTitle": null,
        "tags": ["Madsen", "AH", "breakfast"],
        "ingredients": ["1 1/3 c. flour", "1/3 c. sugar", "2 t. baking powder", "1/2 t. baking soda", "1/2 t. cinnamon", "1/4 t. salt", "1 c. milk", "1 c. cottage cheese", "3 T. melted butter", "2 eggs, separated", "1 t. vanilla"],
        "instructions": "Mix all dry ingredients.  Mix in milk, cottage cheese, melted butter, egg yolks, and vanilla.  Whip egg whites until stiff and then fold into mixture.  Cook on a hot griddle until golden on both sides.  Serve with Butter-Maple Syrup.",
        "picture": null
    },
    {
        "title": "Butter Maple Syrup",
        "subTitle": null,
        "tags": ["Madsen", "AH", "breakfast"],
        "ingredients": ["1 1/3 c. sugar", "2/3 c. water", "1/2 t. maple flavor", "1/4 t. salt", "1/4 t. cream of tartar", "6 T. butter", "1 egg"],
        "instructions": "In a medium sauce pan, bring sugar and water to a boil over high heat.  Remove from heat and add maple flavor, salt, cream of tartar, and butter.  Stir until butter melts.  In a bowl, whip the egg until frothy.  Stir in a couple of spoonfuls of hot syrup to egg mixture and then add the egg mixture to the syrup and stir well.  Return to heat and cook for 2 more minutes.  Serve over pancakes.",
        "picture": null
    },
    {
        "title": "Chinese Chicken Salad",
        "subTitle": null,
        "tags": ["Madsen", "AH", "Lunch", "Dinner", "Salad", "Chinese"],
        "ingredients": ["Lettuce", "Cabbage", "Green onions, diced", "Fresh cilantro", "Chicken, cooked and diced", "Mandarin oranges", "Crushed raman noodles", "1/4 c. oil", "1/4 c. rice vinegar", "2 T. sugar", "2 T. soy sauce", "1/2 t. ginger"],
        "instructions": null,
        "picture": null
    },
    {
        "title": "Crapes",
        "subTitle": null,
        "tags": ["Madsen", "AH", "Breakfast"],
        "ingredients": ["6 eggs", "1 3/4 c. milk", "1 c. water", "1/2 t. salt", "1/3 c. oil", "2 c. flour"],
        "instructions": "Mix all ingredients in a blender.  Strain through a sieve.  Heat a non-stick skillet over medium heat.  Spray with non-stick cooking spray.  Spoon about 3 tablespoons of batter onto the hot skillet and spread in circular motion with the back of a spoon.  Cook until the edges of the crape are light brown, about 45 seconds.  Loosen with a spatula and flip.  Cook on the other side for 20 seconds then remove from the pan. Repeat until the batter is used up.  Serve crapes with strawberry filling and powdered sugar.",
        "picture": null
    },
    {
        "title": "Strawberry Filling",
        "subTitle": null,
        "tags": ["Madsen", "AH", "Breakfast", "Misc"],
        "ingredients": ["4 oz. cream cheese, softened", "1 c. powdered sugar", "1 quart of strawberries, washed and sliced", "8 oz. cool whip"],
        "instructions": "Mix all ingredients in a blender.  Strain through a sieve.  Heat a non-stick skillet over medium heat.  Spray with non-stick cooking spray.  Spoon about 3 tablespoons of batter onto the hot skillet and spread in circular motion with the back of a spoon.  Cook until the edges of the crape are light brown, about 45 seconds.  Loosen with a spatula and flip.  Cook on the other side for 20 seconds then remove from the pan. Repeat until the batter is used up.  Serve crapes with strawberry filling and powdered sugar.",
        "picture": null
    },
    {
        "title": "Crispy Chicken Burritos",
        "subTitle": null,
        "tags": ["Madsen", "AH", "Lunch", "Dinner", "Party", "Mexican"],
        "ingredients": ["8 oz. cream cheese", "3/4 c. green salsa", "3 T. lime juice", "1 1/2 t. cumin", "1 T. chili powder", "1 t. onion powder", "1/2 t. garlic powder", "1/2 c. chopped cilantro", "1/4 c. sliced green onions", "1 1/2 pounds chicken, cooked and diced", "8 oz. pepper jack cheese, grated", "Flour tortillas (about 20)", "Kosher salt", "Cooking spray"],
        "instructions": "Heat cream cheese in the microwave for about 20-30 seconds so it’s soft and easy to stir.  Add green salsa, lime juice, and seasonings.  Stir in cilantro, green onions, chicken, and cheese.  Heat tortillas in the microwave until softened.  Place about a ¼ cup of chicken/cheese filling on a tortilla and roll up tightly.  Place on a greased baking sheet seam side down.  Repeat until all of the filling is used up.  Spray the tops of the burritos lightly with cooking spray and then sprinkle with kosher salt on top.  Bake at 425 degrees for 15-20 minutes until light brown and crispy.",
        "picture": null
    },
    {
        "title": "Eclair Cake",
        "subTitle": null,
        "tags": ["Madsen", "AH", "Dessert", "No Bake"],
        "ingredients": ["1 box of graham crackers", "2 small boxes of instant vanilla pudding", "3  c. milk", "8 oz. cool whip", "1/4 cup butter melted", "2 c. powdered sugar", "3 T. cocoa", "1 t. vanilla", "1/4 c. milk"],
        "instructions": "Mix pudding and milk until dissolved.  Put in refrigerator until set, fold in cool whip.  Layer graham crackers in a 9x13” pan.  Pour half of pudding mixture over crackers then top with another layer of cracker, remaining pudding and a final layer of crackers.  Mix the frosting until smooth and pour over the top layer of crackers.  Refrigerate for several hours.",
        "picture": null
    },
    {
        "title": "Egg Rolls",
        "subTitle": null,
        "tags": ["Madsen", "AH", "Chinese", "Dinner"],
        "ingredients": ["3-4 c. finely chopped cabbage", "1 bunch of green onions, finely chopped", "1 can water chestnuts, finely chopped", "1 carrot, peeled and grated", "2-3 chicken breasts, cooked and finely chopped", "1/4 c. soy sauce", "1 t. garlic powder", "1/2 t. ginger", "Egg roll wrappers"],
        "instructions": "Mix vegetables, chicken, and seasonings together in a bowl.  Place 2 heaping spoonfuls of mixture in the center of a wrapper, roll up, and secure with water.  Deep fry in hot oil until golden brown.",
        "picture": null
    },
    {
        "title": "Granola",
        "subTitle": null,
        "tags": ["Madsen", "AH", "Breakfast", "Snack"],
        "ingredients": ["3 1/2 C. oats", "1 t. cinnamon", "1/4 t. salt", "1/3 C. brown sugar", "1/3 C. honey", "1/4 C. oil", "1 t. vanilla"],
        "instructions": "Mix oats, cinnamon, sat, and brown sugar in a bowl.  In another bowl microwave honey 30 seconds and then add oil and vanilla and then pour over the oat mixture.  Mix well and then spread on a greased cookie sheet.  Bake at 300 degrees for 30 minutes.  Cool completely and then store in an air tight container.",
        "picture": null
    }
]
